In [1]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (1.1.1)

In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (1.1.0)

In [3]:
!pip show sqlalchemy | grep Version

Version: 2.0.30

In [4]:
!pip install --upgrade sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (2.0.30)
Requirement already satisfied: greenlet!=0.4.17 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (4.11.0)

In [5]:
!pip install pandas

Requirement already satisfied: pandas in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in /Users/juanfransf/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [6]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input

In [7]:
#1.  Establish a connection between Python and the Sakila database.

from urllib.parse import quote_plus
from sqlalchemy import create_engine
import getpass

# Datos de conexión
bd = "sakila"

# Solicitar la contraseña al usuario sin mostrarla
password = getpass.getpass("Enter your MySQL password: ")

# Escapar caracteres especiales en la contraseña
password_encoded = quote_plus(password)

# Construir la cadena de conexión
connection_string = f"mysql+pymysql://root:{password_encoded}@localhost/{bd}"
engine = create_engine(connection_string)

print(engine)

Engine(mysql+pymysql://root:***@localhost/sakila)

In [10]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM sakila.actor')
    result = connection.execute(query)

result

In [65]:
#2. Write a Python function called rentals_month
import pandas as pd
from sqlalchemy import text

def rentals_month(engine, month, year):
    sql_query = '''
                SELECT * 
                FROM rental 
                WHERE EXTRACT(MONTH FROM rental_date) = :month 
                AND EXTRACT(YEAR FROM rental_date) = :year
                '''

    with engine.connect() as connection:
        
        query = text(sql_query)
        result = connection.execute(query, {"month": month, "year": year})
        
        # Obtener los resultados como un DataFrame de Pandas
        rental_data = pd.DataFrame(result.fetchall(), columns=result.keys())
    
    return rental_data

In [66]:
rentals_month(engine, 5, 2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [69]:
rental_data = rentals_month(engine, 5, 2005)

In [73]:
#3. Develop a Python function called rental_count_month

import pandas as pd
from sqlalchemy import text

def rental_count_month(rental_data, month, year):
    rental_data_filtered = rental_data[(rental_data['rental_date'].dt.month == month) & 
                                       (rental_data['rental_date'].dt.year == year)]
    rental_counts = rental_data_filtered.groupby('customer_id').size().reset_index(name=f'rentals_{month}_{year}')
    return rental_counts

In [74]:
result_rental_count = rental_count_month(rental_data, 5, 2005)
print(result)

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

In [81]:
# 4. Create a Python function called compare_rentals 

def compare_rentals(rental_data, result_rental_count):
    # Merge the two DataFrames on 'customer_id'
    combined_df = pd.merge(rental_data, result_rental_count, on='customer_id', how='outer')
    
    # Fill NaN values with 0
    combined_df.fillna(0, inplace=True)
    
    # Calculate the difference between the number of rentals in the two months
    if 'rentals_month2' in combined_df.columns and 'rentals_month1' in combined_df.columns:
        combined_df['difference'] = combined_df['rentals_month2'] - combined_df['rentals_month1']
    
    return combined_df

In [83]:
result_combined = compare_rentals(rental_data, result_rental_count)
result_combined

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rentals_5_2005
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2
1,746,2005-05-29 09:25:10,4272,130,2005-06-02 04:20:10,2,2006-02-15 21:30:53,2
2,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,1
3,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,3
4,59,2005-05-25 08:56:42,2884,408,2005-06-01 09:52:42,1,2006-02-15 21:30:53,3
...,...,...,...,...,...,...,...,...
1151,1152,2005-05-31 21:32:17,210,191,2005-06-04 21:07:17,2,2006-02-15 21:30:53,2
1152,1137,2005-05-31 19:20:14,3259,351,2005-06-07 16:10:14,1,2006-02-15 21:30:53,1
1153,1140,2005-05-31 19:36:30,3731,10,2005-06-07 18:33:30,2,2006-02-15 21:30:53,1
1154,1150,2005-05-31 21:20:09,1632,136,2005-06-03 19:15:09,2,2006-02-15 21:30:53,1
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,1